benchmark-results/round-3-intel/smade - 14 - 2.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      9751216.01          ---          ---         0.18566         0.18300         0.23100         0.25500         0.40700         0.53500         1.07100         1.37500         1.80700        48.12700    646484.77 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    9751216.01         0.00         0.00         0.18566         0.18300         0.23100         0.25500         0.40700         0.53500         1.07100         1.37500         1.80700        48.12700    646484.77 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       929080.16          ---          ---         0.16588         0.16700         0.19900         0.21500         0.27100         0.39900         0.56700         0.71900         1.07100         7.74300     61691.06 
Gets      9290699.39     51825.89   9238873.51         0.16577         0.16700         0.19900         0.21500         0.27100         0.39900         0.55900         0.71900         1.06300         7.80700    373038.13 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals   10219779.55     51825.89   9238873.51         0.16578         0.16700         0.19900         0.21500         0.27100         0.39900         0.55900         0.71900         1.06300         7.80700    434729.19 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       135050.68          ---          ---         0.14081         0.14300         0.16700         0.19100         0.23100         0.37500         0.50300         0.63100         0.86300         1.11100      8967.24 
Gets      1350328.55      7961.63   1342366.91         0.14055         0.14300         0.16700         0.19100         0.23100         0.36700         0.49500         0.60700         0.86300         1.10300     54226.92 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1485379.23      7961.63   1342366.91         0.14057         0.14300         0.16700         0.19100         0.23100         0.36700         0.49500         0.60700         0.86300         1.11100     63194.16 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       914923.20          ---          ---         0.17128         0.17500         0.19900         0.22300         0.30300         0.43100         0.57500         0.73500         1.01500         3.05500     60657.59 
Gets      9149131.36   9149131.36         0.00         0.17120         0.17500         0.19900         0.22300         0.30300         0.43100         0.57500         0.73500         1.00700        41.21500    561894.21 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals   10064054.56   9149131.36         0.00         0.17121         0.17500         0.19900         0.22300         0.30300         0.43100         0.57500         0.73500         1.00700        41.21500    622551.80 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       124324.30          ---          ---         0.14099         0.13500         0.17500         0.19900         0.23100         0.37500         0.51900         0.64700         1.11100         1.82300      8242.09 
Gets      1243078.90   1243078.90         0.00         0.14085         0.13500         0.17500         0.19900         0.23100         0.37500         0.49500         0.58300         0.95900         1.15100     76343.19 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1367403.20   1243078.90         0.00         0.14086         0.13500         0.17500         0.19900         0.23100         0.37500         0.49500         0.59100         0.96700         1.82300     84585.28